testdata/IN_2023_02/Roundtrip/antrag/erweiterung/20170220_dgf_absicherungen_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getOrder xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dol="urn:de:vb:bipro:taa:dol:1.12" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         
      <tarif:Request>
              
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
              
        <tarif:Antrag>
                   
          <basis:Erweiterung xsi:type="vb-leben:CT_AntragErweiterung">
                        
            <vb-leben:BestehendeAbsicherungVorhanden>true</vb-leben:BestehendeAbsicherungVorhanden>
                        
            <vb-leben:BestehendeAbsicherung>
                             
              <vb-leben:Beschreibung>Beschreibung 1</vb-leben:Beschreibung>
                             
              <vb-leben:Rente>123.45</vb-leben:Rente>
                          
            </vb-leben:BestehendeAbsicherung>
                        
            <vb-leben:BestehendeAbsicherung>
                             
              <vb-leben:Beschreibung>Beschreibung 2</vb-leben:Beschreibung>
                             
              <vb-leben:Rente>234.56</vb-leben:Rente>
                          
            </vb-leben:BestehendeAbsicherung>
                        
            <vb-leben:BestehendeAbsicherung>
                             
              <vb-leben:Beschreibung>Beschreibung 3</vb-leben:Beschreibung>
                             
              <vb-leben:Rente>345.67</vb-leben:Rente>
                          
            </vb-leben:BestehendeAbsicherung>
                     
          </basis:Erweiterung>
                   
          <gevo:Vermittler>
                        
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                     
          </gevo:Vermittler>
                   
          <gevo:Dokumentanforderung>
                       
            <gevo:ArtID>Antrag</gevo:ArtID>
                     
          </gevo:Dokumentanforderung>
                   
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <partner:PartnerID>1</partner:PartnerID>
                        
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                        
            <partner:Geschlecht>1</partner:Geschlecht>
                        
            <partner:Berufstaetigkeit>
                             
              <partner:Beruf>Notar</partner:Beruf>
                          
            </partner:Berufstaetigkeit>
                        
            <partner:Einkommen>
                              
              <partner:Einkommen>
                                  
                <allg:Betrag>30000</allg:Betrag>
                                  
                <partner:Zahlungsweise>1</partner:Zahlungsweise>
                                  
                <partner:Art>Brutto</partner:Art>
                                
              </partner:Einkommen>
                          
            </partner:Einkommen>
                     
          </tarif:Partner>
                   
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1</partner:PartnerID>
                     
          </tarif:Versicherungsnehmer>
                   
          <tarif:Verkaufsprodukt>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                             
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                                  
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                               
              </basis:Erweiterung>
                             
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                             
              <pm:Versicherungsdauer>
                                 
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                               
              </pm:Versicherungsdauer>
                             
              <pm:Paket xsi:type="dol:STE_PaketErweitert">A</pm:Paket>
                             
              <pm:Kennung>DGF</pm:Kennung>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                  
                <pm:Versicherungsdauer>
                                       
                  <allg:AnzahlJahre>30</allg:AnzahlJahre>
                                    
                </pm:Versicherungsdauer>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                      
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                      
                  <vs-pm:Wert>1501</vs-pm:Wert>
                                      
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                      
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                      
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">08</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>1</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                  
                <pm-leben:Auspraegung xsi:type="dol:STE_UnfaehigkeitsZusatzAuspraegungErweitert">GF</pm-leben:Auspraegung>
                               
              </pm:Elementarprodukt>
                             
              <pm-leben:VorgabeBerechnung>
                                  
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteRente</pm-leben:ArtID>
                                  
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">ArbeitskraftAbsicherung</pm-leben:Kontext>
                               
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                     
          </tarif:Verkaufsprodukt>
                
        </tarif:Antrag>
           
      </tarif:Request>
      
    </tarif:getOrder>
  </soapenv:Body>
</soapenv:Envelope>
